asifahamed-ece/BareMetal_I2C_Driver/blackpill_stm32f411.h
/*
 * blackpill_stm32f411.h
 *
 * Custom hardware abstraction header for WeAct BlackPill V3.0 (STM32F411CEU6)
 * All addresses/offsets extracted from RM0383 Reference Manual
 *
 * Created on: 31-May-2026
 * Author: Asif Ahamed S
 */

#ifndef BLACKPILL_STM32F411_H
#define BLACKPILL_STM32F411_H

#include <stdint.h>

/* ========================================================================
 * MEMORY MAP & BUS BASE ADDRESSES
 * Source: RM0383 Section 2.3 "Memory organization" Table 1
 * These define the start of each peripheral bus region in the 4GB address space
 * ======================================================================== */
#define PERIPH_BASE           ((uint32_t)0x40000000U)  // Start of all peripheral memory region
#define APB1PERIPH_BASE       (PERIPH_BASE + 0x00000000U)  // APB1 bus base (low-speed peripherals)
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000U)  // APB2 bus base (high-speed peripherals)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000U)  // AHB1 bus base (core system peripherals)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x10000000U)  // AHB2 bus base (USB, RNG, etc.)

/* ========================================================================
 * RCC - Reset & Clock Control
 * Source: RM0383 Section 6.3, Table 35 "RCC registers"
 * Controls clock gating for all peripherals - MUST enable before using any peripheral
 * ======================================================================== */
#define RCC_BASE              ((uint32_t)0x40023800U)  // RCC peripheral base address (AHB1 bus)

// RCC Register Pointers (Base + Offset)
#define RCC_CR                (*(volatile uint32_t*)(RCC_BASE + 0x00U))  // Clock control register (HSI/HSE/PLL enable)
#define RCC_PLLCFGR           (*(volatile uint32_t*)(RCC_BASE + 0x04U))  // PLL configuration register
#define RCC_CFGR              (*(volatile uint32_t*)(RCC_BASE + 0x08U))  // Clock configuration register (prescalers, clock source)
#define RCC_CIR               (*(volatile uint32_t*)(RCC_BASE + 0x0CU))  // Clock interrupt register
#define RCC_AHB1ENR           (*(volatile uint32_t*)(RCC_BASE + 0x30U))  // AHB1 peripheral clock enable register
#define RCC_AHB1RSTR          (*(volatile uint32_t*)(RCC_BASE + 0x10U))  // AHB1 peripheral reset register
#define RCC_APB1ENR           (*(volatile uint32_t*)(RCC_BASE + 0x40U))  // APB1 peripheral clock enable register (I2C, USART2, etc)
#define RCC_APB1RSTR          (*(volatile uint32_t*)(RCC_BASE + 0x20U))  // APB1 peripheral reset register
#define RCC_APB2ENR           (*(volatile uint32_t*)(RCC_BASE + 0x44U))  // APB2 peripheral clock enable register (SYSCFG, SPI, USART1, USART6, etc)
#define RCC_APB2RSTR          (*(volatile uint32_t*)(RCC_BASE + 0x24U))  // APB2 peripheral reset register


// RCC_AHB1ENR Bit Masks - Set these bits to ENABLE clock for corresponding peripheral
#define RCC_AHB1ENR_GPIOAEN   (1U << 0)  // Enable GPIOA clock (bit 0)
#define RCC_AHB1ENR_GPIOBEN   (1U << 1)  // Enable GPIOB clock (bit 1)
#define RCC_AHB1ENR_GPIOCEN   (1U << 2)  // Enable GPIOC clock (bit 2) ← Used for PC13 LED
#define RCC_AHB1ENR_GPIODEN   (1U << 3)  // Enable GPIOD clock (bit 3)
#define RCC_AHB1ENR_GPIOEEN   (1U << 4)  // Enable GPIOE clock (bit 4)
#define RCC_AHB1ENR_GPIOHEN   (1U << 7)  // Enable GPIOH clock (bit 7)

// RCC_USART Bit MAsk
#define RCC_USART2EN          (1U << 17) // Enable USAERT2 CLock (Bit 17)

// RCC_APB2ENR Bit Masks
#define RCC_APB2ENR_SYSCFGEN  (1U << 14) // Enable SYSCFG clock (bit 14) ← Required for EXTI pin mapping

/* ========================================================================
 * GPIO PORTS - General Purpose Input/Output
 * Source: RM0383 Section 8.4, Table 27 "GPIO registers"
 * Each port (A-H) has identical register layout at different base addresses
 * ======================================================================== */
// GPIO Port Base Addresses (from RM0383 Table 1)
#define GPIOA_BASE            ((uint32_t)0x40020000U)  // GPIO Port A base address
#define GPIOB_BASE            ((uint32_t)0x40020400U)  // GPIO Port B base address
#define GPIOC_BASE            ((uint32_t)0x40020800U)  // GPIO Port C base address ← Used for PC13 LED
#define GPIOD_BASE            ((uint32_t)0x40020C00U)  // GPIO Port D base address
#define GPIOE_BASE            ((uint32_t)0x40021000U)  // GPIO Port E base address
#define GPIOH_BASE            ((uint32_t)0x40021C00U)  // GPIO Port H base address

// GPIO Register Offsets (relative to GPIOx_BASE) - Same for all ports
#define GPIOx_MODER_OFF       0x00U  // Mode register offset: configures pin as input/output/AF/analog
#define GPIOx_OTYPER_OFF      0x04U  // Output type register offset: push-pull (0) or open-drain (1)
#define GPIOx_OSPEEDR_OFF     0x08U  // Output speed register offset: configures slew rate
#define GPIOx_PUPDR_OFF       0x0CU  // Pull-up/pull-down register offset: configures internal resistors
#define GPIOx_IDR_OFF         0x10U  // Input data register offset: READ-ONLY, reflects pin voltage
#define GPIOx_ODR_OFF         0x14U  // Output data register offset: software-controlled output value
#define GPIOx_BSRR_OFF        0x18U  // Bit set/reset register offset: ATOMIC pin toggle (write-only)
#define GPIOx_LCKR_OFF        0x1CU  // Lock register offset: prevents accidental pin reconfiguration
#define GPIOx_AFRL_OFF        0x20U  // Alternate function low register offset: AF config for pins 0-7
#define GPIOx_AFRH_OFF        0x24U  // Alternate function high register offset: AF config for pins 8-15

// GPIO Register Pointers for GPIOA (PA0-PA15)
#define GPIOA_MODER           (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_MODER_OFF))  // PA pin mode control
#define GPIOA_OTYPER          (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_OTYPER_OFF)) // PA output type control
#define GPIOA_OSPEEDR         (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_OSPEEDR_OFF))// PA output speed control
#define GPIOA_PUPDR           (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_PUPDR_OFF))  // PA pull-up/pull-down control
#define GPIOA_IDR             (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_IDR_OFF))    // PA input data (READ-ONLY)
#define GPIOA_ODR             (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_ODR_OFF))    // PA output data control
#define GPIOA_BSRR            (*(volatile uint32_t*)(GPIOA_BASE + GPIOx_BSRR_OFF))   // PA atomic set/reset

// GPIO Register Pointers for GPIOA (PA0-PA15)
#define GPIOB_MODER           (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_MODER_OFF))  // PB pin mode control
#define GPIOB_OTYPER          (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_OTYPER_OFF)) // PB output type control
#define GPIOB_OSPEEDR         (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_OSPEEDR_OFF))// PB output speed control
#define GPIOB_PUPDR           (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_PUPDR_OFF))  // PB pull-up/pull-down control
#define GPIOB_IDR             (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_IDR_OFF))    // PB input data (READ-ONLY)
#define GPIOB_ODR             (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_ODR_OFF))    // PB output data control
#define GPIOB_BSRR            (*(volatile uint32_t*)(GPIOB_BASE + GPIOx_BSRR_OFF))   // PB atomic set/reset

