asifahamed-ece/BareMetal_I2C_Driver/blackpill_stm32f411.h
// GPIO Register Pointers for GPIOC (PC0-PC15)
#define GPIOC_MODER           (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_MODER_OFF))  // PC pin mode control
#define GPIOC_OTYPER          (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_OTYPER_OFF)) // PC output type control
#define GPIOC_OSPEEDR         (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_OSPEEDR_OFF))// PC output speed control
#define GPIOC_PUPDR           (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_PUPDR_OFF))  // PC pull-up/pull-down control
#define GPIOC_IDR             (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_IDR_OFF))    // PC input data (READ-ONLY)
#define GPIOC_ODR             (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_ODR_OFF))    // PC output data control
#define GPIOC_BSRR            (*(volatile uint32_t*)(GPIOC_BASE + GPIOx_BSRR_OFF))   // PC atomic set/reset

// Alternate Function Registers
#define GPIOA_AFRL           (*(volatile uint32_t*)(GPIOA_BASE + 0x20U))  // PA pin Alt Fn Control (GPIO Pins 0 to 7)
#define GPIOA_AFRH 			 (*(volatile uint32_t*)(GPIOA_BASE + 0x24U))  // For Pins 8 to 15
#define GPIOB_AFRL           (*(volatile uint32_t*)(GPIOB_BASE + 0x20U))  // PA pin Alt Fn Control (GPIO Pins 0 to 7)
#define GPIOB_AFRH 			 (*(volatile uint32_t*)(GPIOB_BASE + 0x24U))  // For Pins 8 to 15

/* ========================================================================
 * SYSCFG - System Configuration Controller
 * Source: RM0383 Section 7.2, Table 30 "SYSCFG registers"
 * Required for EXTI pin mapping (tells EXTI which GPIO port to watch)
 * ======================================================================== */
#define SYSCFG_BASE           ((uint32_t)0x40013800U)  // SYSCFG peripheral base address (APB2 bus)
#define SYSCFG_EXTICR1        (*(volatile uint32_t*)(SYSCFG_BASE + 0x08U))  // EXTI0-3 pin mapping register
#define SYSCFG_EXTICR2        (*(volatile uint32_t*)(SYSCFG_BASE + 0x0CU))  // EXTI4-7 pin mapping register
#define SYSCFG_EXTICR3        (*(volatile uint32_t*)(SYSCFG_BASE + 0x10U))  // EXTI8-11 pin mapping register
#define SYSCFG_EXTICR4        (*(volatile uint32_t*)(SYSCFG_BASE + 0x14U))  // EXTI12-15 pin mapping register

// SYSCFG_EXTICR1 Bit Field Values for EXTI0 mapping (bits [3:0])
#define SYSCFG_EXTICR1_EXTI0_PA  (0x0U << 0)  // Map EXTI0 to PA0
#define SYSCFG_EXTICR1_EXTI0_PB  (0x1U << 0)  // Map EXTI0 to PB0
#define SYSCFG_EXTICR1_EXTI0_PC  (0x2U << 0)  // Map EXTI0 to PC0
#define SYSCFG_EXTICR1_EXTI0_PD  (0x3U << 0)  // Map EXTI0 to PD0

/* ========================================================================
 * EXTI - External Interrupt/Event Controller
 * Source: RM0383 Section 10.3, Table 70 "EXTI registers"
 * Detects edges on GPIO pins and signals NVIC to trigger interrupt
 * ======================================================================== */
#define EXTI_BASE             ((uint32_t)0x40013C00U)  // EXTI peripheral base address (APB2 bus)

// EXTI Register Pointers (Base + Offset)
#define EXTI_IMR              (*(volatile uint32_t*)(EXTI_BASE + 0x00U))  // Interrupt mask register: enable/disable EXTI lines
#define EXTI_EMR              (*(volatile uint32_t*)(EXTI_BASE + 0x04U))  // Event mask register: enable/disable event generation
#define EXTI_RTSR             (*(volatile uint32_t*)(EXTI_BASE + 0x08U))  // Rising trigger selection: detect HIGH→LOW edges
#define EXTI_FTSR             (*(volatile uint32_t*)(EXTI_BASE + 0x0CU))  // Falling trigger selection: detect LOW→HIGH edges
#define EXTI_SWIER            (*(volatile uint32_t*)(EXTI_BASE + 0x10U))  // Software interrupt event register: trigger EXTI manually
#define EXTI_PR               (*(volatile uint32_t*)(EXTI_BASE + 0x14U))  // Pending register: shows which lines triggered (write-1-to-clear)

// EXTI Line Bit Masks (for IMR, FTSR, PR, etc.)
#define EXTI_LINE_0           (1U << 0)   // Bit mask for EXTI Line 0 (PA0/PB0/PC0...)
#define EXTI_LINE_1           (1U << 1)   // Bit mask for EXTI Line 1
#define EXTI_LINE_2           (1U << 2)   // Bit mask for EXTI Line 2
#define EXTI_LINE_3           (1U << 3)   // Bit mask for EXTI Line 3
#define EXTI_LINE_4           (1U << 4)   // Bit mask for EXTI Line 4
#define EXTI_LINE_5           (1U << 5)   // Bit mask for EXTI Line 5
#define EXTI_LINE_6           (1U << 6)   // Bit mask for EXTI Line 6
#define EXTI_LINE_7           (1U << 7)   // Bit mask for EXTI Line 7
#define EXTI_LINE_8           (1U << 8)   // Bit mask for EXTI Line 8
#define EXTI_LINE_9           (1U << 9)   // Bit mask for EXTI Line 9
#define EXTI_LINE_10          (1U << 10)  // Bit mask for EXTI Line 10
#define EXTI_LINE_11          (1U << 11)  // Bit mask for EXTI Line 11
#define EXTI_LINE_12          (1U << 12)  // Bit mask for EXTI Line 12
#define EXTI_LINE_13          (1U << 13)  // Bit mask for EXTI Line 13
#define EXTI_LINE_14          (1U << 14)  // Bit mask for EXTI Line 14
#define EXTI_LINE_15          (1U << 15)  // Bit mask for EXTI Line 15

/* ========================================================================
 * NVIC - Nested Vectored Interrupt Controller
 * Source: ARM DDI0403E Section B3.4, Table B3-8 "NVIC registers"
 * ARM Core peripheral: manages interrupt priorities and dispatch to ISRs
 * ======================================================================== */
#define NVIC_BASE             ((uint32_t)0xE000E100U)  // NVIC base address (Core peripheral, not in RM0383)

// NVIC Register Pointers
#define NVIC_ISER0             (*(volatile uint32_t*)(NVIC_BASE + 0x00U))  // Interrupt Set-Enable Register: enable IRQ by setting bit { For IRQs 0 to 31}
#define NVIC_ISER1            (*(volatile uint32_t*)(NVIC_BASE + 0x04U))  // IRQs 32-63
#define NVIC_ISER1            (*(volatile uint32_t*)(NVIC_BASE + 0x04U))  // IRQs 34-95
#define NVIC_ICER             (*(volatile uint32_t*)(NVIC_BASE + 0x80U))  // Interrupt Clear-Enable Register: disable IRQ by setting bit
#define NVIC_ISPR             (*(volatile uint32_t*)(NVIC_BASE + 0x100U)) // Interrupt Set-Pending Register: manually trigger IRQ
#define NVIC_ICPR             (*(volatile uint32_t*)(NVIC_BASE + 0x180U)) // Interrupt Clear-Pending Register: clear pending IRQ
#define NVIC_IPR              (*(volatile uint32_t*)(NVIC_BASE + 0x400U)) // Interrupt Priority Registers: set priority 0-255

