asifahamed-ece/BareMetal_I2C_Driver/blackpill_stm32f411.h
// NVIC IRQ Numbers for STM32F411 (from RM0383 Table 37 "Vector table")
// Used with NVIC_ISER: NVIC_ISER |= (1U << IRQ_NUMBER)
#define NVIC_IRQ_WWDG         0   // Window Watchdog interrupt
#define NVIC_IRQ_PVD          1   // PVD through EXTI line detection
#define NVIC_IRQ_TAMP_STAMP   2   // Tamper and TimeStamp interrupts
#define NVIC_IRQ_RTC_WKUP     3   // RTC Wakeup interrupt
#define NVIC_IRQ_FLASH        4   // FLASH global interrupt
#define NVIC_IRQ_RCC          5   // RCC global interrupt
#define NVIC_IRQ_EXTI0        6   // EXTI Line 0 interrupt ← Used for PA0 button
#define NVIC_IRQ_EXTI1        7   // EXTI Line 1 interrupt
#define NVIC_IRQ_EXTI2        8   // EXTI Line 2 interrupt
#define NVIC_IRQ_EXTI3        9   // EXTI Line 3 interrupt
#define NVIC_IRQ_EXTI4        10  // EXTI Line 4 interrupt
#define NVIC_IRQ_EXTI9_5      23  // EXTI Lines 9-5 shared interrupt
#define NVIC_IRQ_EXTI15_10    40  // EXTI Lines 15-10 shared interrupt
#define NVIC_IRQ_USART2       38  // USART2 global interrupt
#define NVIC_IRQ_USART1       37  // USART1 global interrupt
#define NVIC_IRQ_USART6       71  // USART6 global interrupt

// Helper Macros for NVIC bit manipulation
#define NVIC_IRQ_BIT(irqn)    (1U << ((irqn) & 0x1FU))  // Calculate bit position in ISER/ICER for given IRQ number
#define NVIC_IRQ_REG(irqn)    ((irqn) >> 5)             // Calculate which ISER register (0-7) for IRQ > 31

/* ========================================================================
 * SYSTICK - Cortex-M4 System Timer
 * Source: ARM DDI0403E Section B3.3 "SysTick Timer"
 * Core peripheral: provides precise timing, RTOS tick, delays
 * ======================================================================== */
#define SYSTICK_BASE          ((uint32_t)0xE000E010U)  // SysTick base address (Core peripheral)

// SysTick Register Pointers
#define STK_CSR               (*(volatile uint32_t*)(SYSTICK_BASE + 0x00U))  // Control and Status register
#define STK_RVR               (*(volatile uint32_t*)(SYSTICK_BASE + 0x04U))  // Reload Value register (24-bit)
#define STK_CVR               (*(volatile uint32_t*)(SYSTICK_BASE + 0x08U))  // Current Value register (read-only, clears on read)
#define STK_CALIB             (*(volatile uint32_t*)(SYSTICK_BASE + 0x0CU))  // Calibration Value register (read-only)

// STK_CSR Bit Masks
#define STK_CSR_ENABLE        (1U << 0)  // Bit 0: Enable SysTick counter (1=enabled, 0=disabled)
#define STK_CSR_TICKINT       (1U << 1)  // Bit 1: Enable SysTick interrupt (1=interrupt on underflow)
#define STK_CSR_CLKSOURCE     (1U << 2)  // Bit 2: Clock source (1=processor clock, 0=external reference)
#define STK_CSR_COUNTFLAG     (1U << 16) // Bit 16: Count flag (set when counter reaches 0, read-only)

/* ========================================================================
 * CORE UTILITY MACROS
 * ARM Cortex-M4 assembly instructions for power management and memory ordering
 * ======================================================================== */
#define __WFI()               __asm__ volatile ("wfi")  // Wait For Interrupt: puts CPU to sleep until interrupt occurs
#define __WFE()               __asm__ volatile ("wfe")  // Wait For Event: sleep until event signal (SEV) received
#define __SEV()               __asm__ volatile ("sev")  // Send Event: wakes all CPUs waiting on WFE
#define __DSB()               __asm__ volatile ("dsb")  // Data Synchronization Barrier: ensures memory accesses complete
#define __DMB()               __asm__ volatile ("dmb")  // Data Memory Barrier: ensures memory access ordering
#define __ISB()               __asm__ volatile ("isb")  // Instruction Synchronization Barrier: flushes pipeline after config changes


/* ========================================================================
 * USART Register Addresses and Offsets
 * Source: RM0383 Section 19.6  :  Table 88
 * ======================================================================== */
#define USART1_BASE 			((uint32_t)(0x40011000U))
#define USART2_BASE 			((uint32_t)(0x40004400U))
#define USART6_BASE 			((uint32_t)(0x40011400U))

/* USART2-Specific Register Pointers */
#define USART2_SR         (*(volatile uint32_t*)(USART2_BASE + 0x00U))
#define USART2_DR         (*(volatile uint32_t*)(USART2_BASE + 0x04U))
#define USART2_BRR        (*(volatile uint32_t*)(USART2_BASE + 0x08U))
#define USART2_CR1        (*(volatile uint32_t*)(USART2_BASE + 0x0CU))
#define USART2_CR2        (*(volatile uint32_t*)(USART2_BASE + 0x10U))
#define USART2_CR3        (*(volatile uint32_t*)(USART2_BASE + 0x14U))

/* USART_CR1 Bit Masks (RM0383 Section 19.6.1) */
#define USART_CR1_UE      (1U << 13)  // USART Enable
#define USART_CR1_TE      (1U << 3)   // Transmitter Enable
#define USART_CR1_RE      (1U << 2)   // Receiver Enable
#define USART_CR1_RXNEIE  (1U << 5)   // RXNE Interrupt Enable (for Interrupt Driven Non-Blocking Rx)

// Status Bits
#define USART2_SR_TXE         (1U << 7)   // Transmit Data Register Empty
#define USART2_SR_RXNE        (1U << 5)   // Receive Data Register Not Empty

/* ========================================================================
 * GPIO PIN HELPER MACROS (Optional but for better readability)
 * Calculate bit positions for a given pin number in GPIO registers
 * ======================================================================== */
// MODER/PUPDR/OSPEEDR: each pin uses 2 bits, position = pin_number * 2
#define GPIO_PIN_MODE_SHIFT(pin)    ((pin) * 2U)  // Calculate bit shift for pin in MODER/PUPDR/OSPEEDR

// BSRR: bits [15:0] set pin HIGH, bits [31:16] reset pin LOW
#define GPIO_BSRR_SET(pin)          (1U << (pin))        // BSRR value to SET pin HIGH
#define GPIO_BSRR_RST(pin)        (1U << ((pin) + 16U)) // BSRR value to RESET pin LOW

// IDR/ODR: each pin uses 1 bit at position = pin_number
#define GPIO_PIN_MASK(pin)          (1U << (pin))  // Bit mask to read/write single pin in IDR/ODR

