asifahamed-ece/BareMetal_I2C_Driver/blackpill_stm32f411.h
/* ========================================================================
 * ADC1 - Analog to Digital Converter
 * Source: RM0383 Section 12 "Analog-to-digital converter (ADC)"
 * ======================================================================== */
#define ADC1_BASE             ((uint32_t)0x40012000U)  // ADC1 base address (APB2 bus)

// ADC Register Pointers (Base + Offset)
#define ADC1_SR               (*(volatile uint32_t*)(ADC1_BASE + 0x00U))  // Status register
#define ADC1_CR1              (*(volatile uint32_t*)(ADC1_BASE + 0x04U))  // Control register 1
#define ADC1_CR2              (*(volatile uint32_t*)(ADC1_BASE + 0x08U))  // Control register 2
#define ADC1_SMPR1            (*(volatile uint32_t*)(ADC1_BASE + 0x0CU))  // Sample time register 1
#define ADC1_SMPR2            (*(volatile uint32_t*)(ADC1_BASE + 0x10U))  // Sample time register 2
#define ADC1_JOFR1            (*(volatile uint32_t*)(ADC1_BASE + 0x14U))  // Injected channel data offset
#define ADC1_JOFR2            (*(volatile uint32_t*)(ADC1_BASE + 0x18U))  // Injected channel data offset
#define ADC1_JOFR3            (*(volatile uint32_t*)(ADC1_BASE + 0x1CU))  // Injected channel data offset
#define ADC1_JOFR4            (*(volatile uint32_t*)(ADC1_BASE + 0x20U))  // Injected channel data offset
#define ADC1_HTR              (*(volatile uint32_t*)(ADC1_BASE + 0x24U))  // Watchdog higher threshold
#define ADC1_LTR              (*(volatile uint32_t*)(ADC1_BASE + 0x28U))  // Watchdog lower threshold
#define ADC1_SQR1             (*(volatile uint32_t*)(ADC1_BASE + 0x2CU))  // Regular sequence register 1
#define ADC1_SQR2             (*(volatile uint32_t*)(ADC1_BASE + 0x30U))  // Regular sequence register 2
#define ADC1_SQR3             (*(volatile uint32_t*)(ADC1_BASE + 0x34U))  // Regular sequence register 3
#define ADC1_JSQR             (*(volatile uint32_t*)(ADC1_BASE + 0x38U))  // Injected sequence register
#define ADC1_JDR1             (*(volatile uint32_t*)(ADC1_BASE + 0x3CU))  // Injected data register 1
#define ADC1_JDR2             (*(volatile uint32_t*)(ADC1_BASE + 0x40U))  // Injected data register 2
#define ADC1_JDR3             (*(volatile uint32_t*)(ADC1_BASE + 0x44U))  // Injected data register 3
#define ADC1_JDR4             (*(volatile uint32_t*)(ADC1_BASE + 0x48U))  // Injected data register 4
#define ADC1_DR               (*(volatile uint32_t*)(ADC1_BASE + 0x4CU))  // Regular data register
#define ADC1_CCR              (*(volatile uint32_t*)(ADC1_BASE + 0x308U)) // Common control register (for calibration)

// ADC_SR Bit Masks (Status Register)
#define ADC_SR_EOC            (1U << 1)   // End of Conversion flag (bit 1)
#define ADC_SR_AWD            (1U << 2)   // Analog watchdog flag
#define ADC_SR_JEOC           (1U << 3)   // Injected channel end of conversion
#define ADC_SR_JSTRT          (1U << 4)   // Injected channel Start flag
#define ADC_SR_STRT           (1U << 5)   // Regular channel Start flag

// ADC_CR1 Bit Masks  (Control Register 1)
#define ADC_CR1_AWDCH         (0x1FU << 0)  // Analog watchdog channel select
#define ADC_CR1_EOCIE         (1U << 5)   // Interrupt enable for EOC
#define ADC_CR1_AWDIE         (1U << 6)   // Analog watchdog interrupt enable
#define ADC_CR1_JEOCIE        (1U << 7)   // Interrupt enable for injected channels
#define ADC_CR1_SCAN          (1U << 8)   // Scan mode
#define ADC_CR1_AWDSGL        (1U << 9)   // Enable the watchdog on a single channel
#define ADC_CR1_JAUTO         (1U << 10)  // Automatic injected group conversion
#define ADC_CR1_JDISCEN       (1U << 11)  // Discontinuous mode on injected channels
#define ADC_CR1_DISCEN        (1U << 12)  // Discontinuous mode on regular channels
#define ADC_CR1_DISCNUM       (0x7U << 13) // Discontinuous mode channel count
#define ADC_CR1_JAWDEN        (1U << 22)  // Analog watchdog enable on injected channels
#define ADC_CR1_AWDEN         (1U << 23)  // Analog watchdog enable on regular channels
#define ADC_CR1_RES           (0x3U << 24) // Resolution (12-bit = 00)
#define ADC_CR1_OVERW         (1U << 26)  // Overrun mode

// ADC_CR2 Bit Masks	(Control Register 2)
#define ADC_CR2_ADON          (1U << 0)   // A/D Converter ON / OFF
#define ADC_CR2_CONT          (1U << 1)   // Continuous Conversion
#define ADC_CR2_DMA           (1U << 8)   // Direct memory access mode
#define ADC_CR2_DDS           (1U << 9)   // DMA disable selection
#define ADC_CR2_EOCS          (1U << 10)  // End of conversion selection
#define ADC_CR2_ALIGN         (1U << 11)  // Data alignment (0=right, 1=left)
#define ADC_CR2_JEXTSEL       (0xFU << 12) // External trigger select for injected
#define ADC_CR2_JEXTEN        (0x3U << 16) // External trigger enable for injected
#define ADC_CR2_JSWSTART      (1U << 22)  // Start conversion of injected channels
#define ADC_CR2_EXTSEL        (0xFU << 24) // External trigger select for regular
#define ADC_CR2_EXTEN         (0x3U << 28) // External trigger enable for regular
#define ADC_CR2_SWSTART       (1U << 30)  // Start conversion of regular channels

// ADC_SMPR2 Bit Masks (for channels 0-9)
// Each channel uses 3 bits for sample time selection
#define ADC_SMPR2_SMP0        (0x7U << 0)   // Channel 0 sample time
#define ADC_SMPR2_SMP1        (0x7U << 3)   // Channel 1 sample time (PA1 = ADC1_CH1)
#define ADC_SMPR2_SMP2        (0x7U << 6)   // Channel 2 sample time
// ... (add more as needed)

// Sample time values (cycles)
#define ADC_SMP_3CYCLES       0x0U
#define ADC_SMP_15CYCLES      0x1U
#define ADC_SMP_28CYCLES      0x2U
#define ADC_SMP_56CYCLES      0x3U
#define ADC_SMP_84CYCLES      0x4U
#define ADC_SMP_112CYCLES     0x5U
#define ADC_SMP_144CYCLES     0x6U
#define ADC_SMP_480CYCLES     0x7U

// RCC_APB2ENR Bit for ADC1
#define RCC_APB2ENR_ADC1EN    (1U << 8)   // Bit 8: Enable ADC1 clock

/* ========================================================================
 * TIM3 - General Purpose Timer (APB1 Bus)
 * ======================================================================== */
#define TIM3_BASE             ((uint32_t)0x40000400U)

#define TIM3_CR1              (*(volatile uint32_t*)(TIM3_BASE + 0x00U))
#define TIM3_EGR              (*(volatile uint32_t*)(TIM3_BASE + 0x14U))
#define TIM3_CCMR1            (*(volatile uint32_t*)(TIM3_BASE + 0x18U))
#define TIM3_CCER             (*(volatile uint32_t*)(TIM3_BASE + 0x20U))
#define TIM3_PSC              (*(volatile uint32_t*)(TIM3_BASE + 0x28U))
#define TIM3_ARR              (*(volatile uint32_t*)(TIM3_BASE + 0x2CU))
#define TIM3_CCR1             (*(volatile uint32_t*)(TIM3_BASE + 0x34U))

