asifahamed-ece/BareMetal_I2C_Driver/blackpill_stm32f411.h
/* ========================================================================
 * I2C1 - Inter-Integrated Circuit (APB1 Bus)
 * ======================================================================== */
#define I2C1_BASE             ((uint32_t)0x40005400U)

#define I2C1_CR1              (*(volatile uint32_t*)(I2C1_BASE + 0x00U))
#define I2C1_CR2              (*(volatile uint32_t*)(I2C1_BASE + 0x04U))
#define I2C1_OAR1             (*(volatile uint32_t*)(I2C1_BASE + 0x08U))
#define I2C1_DR               (*(volatile uint32_t*)(I2C1_BASE + 0x10U))
#define I2C1_SR1              (*(volatile uint32_t*)(I2C1_BASE + 0x14U))
#define I2C1_SR2              (*(volatile uint32_t*)(I2C1_BASE + 0x18U))
#define I2C1_CCR              (*(volatile uint32_t*)(I2C1_BASE + 0x1CU))
#define I2C1_TRISE            (*(volatile uint32_t*)(I2C1_BASE + 0x20U))

// I2C1 Control Bits
#define I2C_CR1_PE            (1U << 0)   // Peripheral Enable
#define I2C_CR1_START         (1U << 8)   // Start Generation
#define I2C_CR1_STOP          (1U << 9)   // Stop Generation
#define I2C_CR1_ACK           (1U << 10)  // Acknowledge Enable

// I2C1 Status Bits
#define I2C_SR1_SB            (1U << 0)   // Start Bit (Master mode)
#define I2C_SR1_ADDR          (1U << 1)   // Address sent (master) / matched (slave)
#define I2C_SR1_TXE           (1U << 7)   // Data register empty (transmitters)
#define I2C1_SR1_ACK_FAILURE  (1U << 10)  // Acknowledge Failure Flag: ( 1- ACK Failed, 0- ACK Not failed)

// RCC APB1ENR Bit for I2C1
#define RCC_APB1ENR_I2C1EN    (1U << 21)  // Bit 21: Enable I2C1 clock

// RCC APB1ENR Bit for TIM3
#define RCC_APB1ENR_TIM3EN    (1U << 1)   // Bit 1: Enable TIM3 clock

#endif /* BLACKPILL_STM32F411_H */
